Repository: imsgao/TGStrings
Catalog: Strings/*.lproj/ICLocalizable.strings
Languages: ar, ca, pl

# Settings.ContentSettings
source: Content Settings
ar: إعدادات المحتوى
ca: Configuració del Contingut
pl: Ustawienia zawartości

# Settings.Tabs.Header
source: TABS
ar: تبويبات
ca: PESTANYES
pl: ZAKŁADKI

# Settings.Tabs.HideTabBar
source: Hide Tab bar
ar: إخفاء شريط علامات التبويب
ca: Amagar barra de pestanyes
pl: Ukryj pasek zakładek

# Settings.Tabs.ShowContacts
source: Show Contacts Tab
ar: إظهار تبويب جهات الاتصال
ca: Mostrar Pestanya de Contactes
pl: Pokaż zakładkę kontakty

# Settings.Tabs.ShowNames
source: Show Tab Names
ar: إظهار أسماء التبويبات
ca: Mostrar noms de les pestanyes
pl: Pokaż nazwy zakładek

# Settings.Folders.BottomTab
source: Folders at Bottom
ar: المجلدات في الأسفل
ca: Carpetes a la part inferior
pl: Foldery na dole

# Settings.Folders.BottomTabStyle
source: Bottom Folders Style
ar: نمط المجلدات السفلية
pl: Styl folderów na dole

# Settings.Folders.AllChatsHidden
source: Hide "%@"
ar: إخفاء "%@"
ca: Amaga "%@"
pl: Ukryj "%@"

# Settings.Folders.RememberLast
source: Open Last Folder
ar: فتح المجلد الأخير
ca: Obrir l'última carpeta
pl: Otwórz ostatni folder

# Settings.Folders.RememberLast.Notice
source: IntentChat will open the last used folder when you restart the app or switch accounts.
ar: سيفتح IntentChat آخر مجلد مستخدم عند إعادة تشغيل التطبيق أو تبديل الحسابات.
ca: IntentChat obrirà l'última carpeta utilitzada després de reiniciar o canviar de compte.
pl: IntentChat otworzy ostatnio używany folder po ponownym uruchomieniu lub zmianie konta

# Settings.Folders.CompactNames
source: Smaller spacing
ar: مسافات أصغر
ca: Espaiat més petit
pl: Mniejszy odstęp

# Settings.Folders.AllChatsTitle
source: "All Chats" title
ar: عنوان "كل المحادثات"
ca: Títol "Tots els xats"
pl: Tytuł "Wszystkie czaty"

# Settings.Folders.AllChatsTitle.short
source: Short
ar: قصير
ca: Curt
pl: Krótki

# Settings.Folders.AllChatsTitle.long
source: Long
ar: طويل
ca: Llarg
pl: Długie

# Settings.Folders.AllChatsTitle.none
source: Default
ar: الافتراضي
ca: Per defecte
pl: Domyślny

# Settings.ChatList.Header
source: CHAT LIST
ar: قائمة الفواصل
ca: LLISTA DE XATS
pl: LISTA CZATU

# Settings.CompactChatList
source: Compact Chat List
ar: قائمة الدردشة المتراصة
ca: Llista de xats compacta
pl: Kompaktowa lista czatów

# Settings.Profiles.Header
source: PROFILES
ar: الملفات الشخصية
ca: PERFILS

# Settings.Stories.Hide
source: Hide Stories
ar: إخفاء القصص
ca: Amagar Històries
pl: Ukryj relacje

# Settings.Stories.WarnBeforeView
source: Ask Before Viewing
ar: اسأل قبل العرض
ca: Preguntar abans de veure
pl: Pytaj przed wyświetleniem

# Settings.Stories.DisableSwipeToRecord
source: Disable Swipe to Record
ar: تعطيل السحب للتسجيل
ca: Desactivar lliscar per enregistrar
pl: Wyłącz przeciągnij, aby nagrać

# Settings.Translation.QuickTranslateButton
source: Quick Translate button
ar: زر الترجمة الفوري
ca: Botó de Traducció Ràpida
pl: Przycisk Szybkie tłumaczenie

# Stories.Warning.Author
source: Author
ar: الكاتب
ca: Autor
pl: Autor

# Stories.Warning.ViewStory
source: View Story?
ar: عرض القصة؟
ca: Veure Història?
pl: Zobaczyć relację?

# Stories.Warning.Notice
source: %@ WILL BE ABLE TO SEE that you viewed their Story.
ar: %@ WILL BE يتم إخبارهم بأنك شاهدت قصتهم.
ca: %@ PODRÀ VEURE que has vist la seva Història.
pl: %@ BĘDZIE WIEDZIAŁ, że obejrzano jego relację.

# Stories.Warning.NoticeStealth
source: %@ will not be able to see that you viewed their Story.
ar: %@ لن يتمكن من رؤية أنك شاهدت قصته.
ca: %@ no podrà veure que has vist la seva Història.
pl: %@ nie będzie wiedział, że obejrzano jego relację.

# Settings.Photo.Quality.Notice
source: Quality of uploaded photos and stories.
ar: جودة الصور والصور الصادرة والقصص.
ca: Qualitat de les fotos sortints i històries de fotos.
pl: Jakość wysyłanych zdjęć i fotorelacji

# Settings.Photo.SendLarge
source: Send Large Photos
ar: إرسال صور كبيرة
ca: Enviar fotos grans
pl: Wyślij duże zdjęcia

# Settings.Photo.SendLarge.Notice
source: Increase the side limit on compressed images to 2560px.
ar: زيادة الحد الجانبي للصور المضغوطة إلى 2560 بكسل.
ca: Incrementar el límit de mida en imatges comprimides a 2560px.
pl: Zwiększ limit rozmiaru skompresowanych obrazów do 2560px

# Settings.VideoNotes.Header
source: ROUND VIDEOS
ar: فيديوهات مستديرة
ca: VÍDEOS RODONS
pl: OKRĄGŁE WIDEO

# Settings.VideoNotes.StartWithRearCam
source: Start with Rear Camera
ar: البدء بالكاميرا الخلفية
ca: Començar amb càmera posterior
pl: Uruchom z tylną kamerą

# Settings.CustomColors.Header
source: ACCOUNT COLORS
ar: ألوان الحساب
ca: COLORS DEL COMPTE
pl: KOLORY KONTA

# Settings.CustomColors.Saturation
source: SATURATION
ar: مستوى التشبع
ca: SATURACIÓ
pl: NASYCENIE

# Settings.CustomColors.Saturation.Notice
source: Set to 0%% to disable account colors.
ar: تعيين التشبع إلى 0%% لتعطيل ألوان الحساب.
ca: Estableix la saturació a 0%% per desactivar els colors del compte.
pl: Ustaw nasycenie na 0%%, aby wyłączyć kolory konta

# Settings.UploadsBoost
source: Upload Boost
ar: تعزيز التحميلات
ca: Millora de càrregues
pl: Przyśpieszenie wysyłania

# Settings.DownloadsBoost
source: Download Boost
ar: تعزيز التنزيلات
ca: Millora de baixades
pl: Przyśpieszenie pobierania

# Settings.DownloadsBoost.Notice
source: Increases number of parallel connections and size of file chunks. In case your network can't handle the load, try different options that suits your connection.
ar: يزيد من عدد الاتصالات المتوازية وحجم أجزاء الملفات. إذا لم يتمكن شبكتك من تحمل الحمل، حاول خيارات مختلفة تناسب اتصالك.
ca: Augmenta el nombre de connexions paral·leles i la mida de les parts de fitxer. Si la teva xarxa no pot gestionar la càrrega, prova diferents opcions que s'adaptin a la teva connexió.
pl: Zwiększa liczbę równoległych połączeń oraz rozmiar fragmentów plików. Jeśli Twoja sieć nie jest w stanie znieść obciążenia, wypróbuj różne opcje, które pasują do Twojego połączenia.

# Settings.DownloadsBoost.none
source: Disabled
ar: تعطيل
ca: Desactivat
pl: Wyłączone

# Settings.DownloadsBoost.medium
source: Medium
ar: متوسط
ca: Mitjà
pl: Średnie

# Settings.DownloadsBoost.maximum
source: Maximum
ar: الحد الاقصى
ca: Màxim
pl: Maksymalne

# Settings.ShowProfileID
source: Show Profile ID
ar: إظهار معرف الملف الشخصي ID
ca: Mostrar ID de perfil
pl: Pokaż ID

# Settings.ShowDC
source: Show Data Center
ar: إظهار مركز البيانات
ca: Mostrar Data Center
pl: Pokaż centrum danych

# Settings.ShowCreationDate
source: Show Chat Creation Date
ar: إظهار تاريخ إنشاء المحادثة
ca: Mostrar Data de Creació de Xat
pl: Pokaż datę utworzenia czatu

# Settings.ShowCreationDate.Notice
source: The creation date may be unknown for some chats.
ar: قد يكون تاريخ الإنشاء مفقوداً لبضع المحادثات.
ca: La data de creació pot ser desconeguda per alguns xats.
pl: Data utworzenia może być nieznana dla niektórych czatów.

# Settings.ShowRegDate
source: Show Registration Date
ar: إظهار تاريخ التسجيل
ca: Mostra la data d'inscripció
pl: Pokaż datę rejestracji

# Settings.ShowRegDate.Notice
source: The registration date is approximate.
ar: تاريخ التسجيل تقريبي.
ca: La data d'inscripció és aproximada.
pl: Data rejestracji jest przybliżona.

# Settings.SendWithReturnKey
source: Send with "return" key
ar: إرسال مع مفتاح "العودة"
ca: Enviar amb clau "retorn"
pl: Wyślij klawiszem „return”

# Settings.HidePhoneInSettingsUI
source: Hide Phone in Settings
ar: إخفاء الرقم من الإعدادات
ca: Amagar telèfon en la interfície d'ajustos
pl: Ukryj numer telefonu w ustawieniach

# Settings.HidePhoneInSettingsUI.Notice
source: This will only hide your phone number from the settings interface. To hide it from others, go to Privacy and Security.
ar: سيتم اخفاء رقمك من التطبيق فقط. لأخفاءهُ من المستخدمين الآخرين، يرجى استخدام إعدادات الخصوصية.
ca: Això només amagarà el teu número de telèfon de la interfície d'ajustos. Per amagar-lo als altres, ves a Privadesa i Seguretat.
pl: Twój numer zostanie ukryty tylko w interfejsie użytkownika. Aby ukryć go przed innymi, użyj ustawień prywatności.

# PasscodeSettings.AutoLock.InFiveSeconds
source: If away for 5 seconds
ar: إذا كان بعيدا لمدة 5 ثوان
ca: Si no hi ha en 5 segons
pl: Jeśli nieobecny przez 5 sekund

# ProxySettings.UseSystemDNS
source: Use system DNS
ar: استخدم DNS النظام
ca: Utilitzar DNS del sistema
pl: Użyj systemowego DNS

# ProxySettings.UseSystemDNS.Notice
source: Use system DNS to bypass timeout if you don't have access to Google DNS
ar: استخدم نظام DNS لتجاوز المهلة إذا لم تكن لديك حق الوصول إلى Google DNS
ca: Utilitzar DNS del sistema per evitar el temps d'espera si no tens accés a Google DNS
pl: Użyj systemowego DNS, aby ominąć limit czasu, jeśli nie masz dostępu do Google DNS

# Common.NoTelegramPremiumNeeded
source: You **don't need** %@!
ar: أنت **لا تحتاج** %@!
ca: No **necessites** %@!
pl: Nie **potrzebujesz** %@!

# Common.RestartRequired
source: Restart required
ar: إعادة التشغيل مطلوب
ca: Reinici requerit
pl: Wymagany restart

# Common.RestartNow
source: Restart Now
ar: إعادة التشغيل الآن
ca: Reiniciar Ara
pl: Uruchom teraz ponownie

# Common.OpenTelegram
source: Open Telegram
ar: افتح Telegram
ca: Obrir Telegram
pl: Otwórz Telegram

# Common.UseTelegramForPremium
source: Please note that to get Telegram Premium, you must use the official Telegram app. Once you have obtained Telegram Premium, all its features will become available in IntentChat.
ar: يُرجى ملاحظة أنه للحصول على Telegram Premium، يجب عليك استخدام تطبيق تيليجرام الرسمي. بمجرد حصولك على Telegram Premium، ستصبح جميع ميزاته متاحة في IntentChat.
ca: Recorda que per obtenir Telegram Premium, has d'utilitzar l'aplicació oficial de Telegram. Un cop hagis obtingut Telegram Premium, totes les seves funcions estaran disponibles a IntentChat.
pl: Pamiętaj, że aby otrzymać Telegram Premium, musisz skorzystać z oficjalnej aplikacji Telegram. Po uzyskaniu Telegram Premium wszystkie jego funkcje staną się dostępne w IntentChat.

# Message.HoldToShowOrReport
source: Hold to Show or Report.
ar: اضغط للعرض أو الإبلاغ.
ca: Mantingues per Mostrar o Informar.
pl: Przytrzymaj, aby Pokazać lub Zgłosić.

# Auth.AccountBackupReminder
source: Make sure you have a backup access method. Keep a SIM for SMS or an additional session logged in to avoid being locked out.
ar: تأكد من أن لديك طريقة الوصول إلى النسخ الاحتياطي. حافظ على شريحة SIM للرسائل القصيرة أو جلسة إضافية لتسجيل الدخول لتجنب أن تكون مغفلة.
ca: Assegura't de tenir un mètode d'accés de reserva. Mantingues un SIM per a SMS o una sessió addicional registrada per evitar quedar bloquejat.
pl: Upewnij się, że masz zapasową metodę dostępu. Zachowaj SIM do SMS-ów lub zalogowaną dodatkową sesję, aby uniknąć zablokowania.

# Auth.UnofficialAppCodeTitle
source: You can get the code only with official app
ar: يمكنك الحصول على الرمز فقط من خلال التطبيق الرسمي
ca: Només pots obtenir el codi amb l'aplicació oficial
pl: Kod można uzyskać tylko za pomocą oficjalnej aplikacji

# Settings.SmallReactions
source: Small Reactions
ar: ردود أفعال صغيرة
ca: Petites reaccions
pl: Małe reakcje

# Settings.HideReactions
source: Hide Reactions
ar: إخفاء الردود
ca: Amaga les reaccions
pl: Ukryj Reakcje

# ContextMenu.SaveToCloud
source: Save to Cloud
ar: الحفظ في السحابة
ca: Desar al Núvol
pl: Zapisz w chmurze

# ContextMenu.SelectFromUser
source: Select from Author
ar: حدد من المؤلف
ca: Seleccionar de l'Autor
pl: Zaznacz od autora

# Settings.ContextMenu
source: CONTEXT MENU
ar: قائمة السياق
ca: MENÚ CONTEXTUAL
pl: MENU KONTEKSTOWE

# Settings.ContextMenu.Notice
source: Disabled entries will be available in "IntentChat" sub-menu.
ar: المدخلات المعطلة ستكون متوفرة في القائمة الفرعية "IntentChat".
ca: Les entrades desactivades estaran disponibles al submenú "IntentChat".
pl: Wyłączone wpisy będą dostępne w podmenu „IntentChat”.

# Settings.ChatSwipeOptions
source: Chat List Swipe Options
ar: خيارات التمرير لقائمة المحادثة
ca: Opcions desplaçament de la llista de xats
pl: Opcje przesuwania listy czatów

# Settings.DeleteChatSwipeOption
source: Swipe to Delete Chat
ar: اسحب لحذف المحادثة
ca: Desplaceu-vos per esborrar la conversa
pl: Przesuń, aby usunąć czat

# Settings.PullToNextChannel
source: Pull to Next Unread Channel
ar: اسحب للقناة الغير مقروءة التالية
ca: Arrossega cap al següent canal no llegit
pl: Pociągnij ➝ następny kanał

# Settings.PullToNextTopic
source: Pull to Next Topic
ar: اسحب للموضوع التالي
ca: Arrosega cap al següent tema
pl: Przeciągnij, aby przejść do następnego tematu

# Settings.GalleryCamera
source: Camera in Gallery
ar: الكاميرا في معرض الصور
ca: Càmera a la galeria
pl: Aparat w galerii

# Settings.SendAsButton
source: "%@" Button
ar: زر "%@"
ca: "%@" Botó
pl: Przycisk „%@”

# Settings.SnapDeletionEffect
source: Message Deletion Effects
ar: تأثيرات حذف الرسالة
ca: Efectes d'eliminació de missatges
pl: Efekty usuwania wiadomości

# Settings.Stickers.Size
source: SIZE
ar: مقاس
ca: GRANOR
pl: WIELKOŚĆ

# Settings.Stickers.Timestamp
source: Show Timestamp
ar: إظهار الطابع الزمني
ca: Mostra l'estona
pl: Pokaż znak czasu

# Settings.RecordingButton
source: Voice Recording Button
ar: زر التسجيل الصوتي
ca: Botó d'enregistrament de veu
pl: Przycisk głośności nagrywania

# Settings.DefaultEmojisFirst
source: Prioritize standard emojis
ar: الأفضلية للرموز التعبيرية الافتراضية
ca: Prioritzar emojis estàndard
pl: Wybierz standardowe emotikony

# Settings.DefaultEmojisFirst.Notice
source: Show standard emojis before premium in emoji keyboard
ar: عرض الرموز التعبيرية الافتراضية قبل الرموز المتميزة في لوحة المفاتيح
ca: Mostra emojis estàndard abans que premium al teclat emoji
pl: Pokaż standardowe emotikony przed premium na klawiaturze emotikonów

# Chat.Created
source: created: %@
ar: تم إنشاؤه: %@
ca: creada: %@
pl: utworzony: %@

# Chat.JoinedDateTitle
source: Joined %@
ar: انضم %@
ca: Unida a %@
pl: Dołączył %@

# Chat.RegDate
source: Registered
ar: مسجل
ca: Inscrit
pl: Zarejestrowane

# Settings.messageDoubleTapActionOutgoingEdit
source: Double-tap to edit message
ar: اضغط مزدوجًا لتحرير الرسالة
ca: Toqueu dues vegades per editar el missatge
pl: Podwójne stuknięcie, aby edytować wiadomość

# Settings.wideChannelPosts
source: Wide posts in channels
ar: المشاركات الواسعة في القنوات
ca: Entrades àmplies als canals
pl: Szerokie posty w kanałach

# Settings.ForceEmojiTab
source: Emoji keyboard by default
ar: لوحة مفاتيح الرموز التعبيرية افتراضيًا
ca: Teclat d'emojis per defecte
pl: Klawiatura emoji domyślnie

# Settings.forceBuiltInMic
source: Force Device Microphone
ar: قوة ميكروفون الجهاز
ca: Força el Micròfon del Dispositiu
pl: Wymuś mikrofon urządzenia

# Settings.forceBuiltInMic.Notice
source: If enabled, app will use only device microphone even if headphones are connected.
ar: إذا تم تمكينه، سيستخدم التطبيق فقط ميكروفون الجهاز حتى لو كانت سماعات الرأس متصلة.
ca: Si està habilitat, l'aplicació utilitzarà només el micròfon del dispositiu encara que estiguin connectats els auriculars.
pl: Jeśli ta opcja jest włączona, aplikacja będzie korzystać tylko z mikrofonu urządzenia nawet jeśli są podłączone słuchawki.

# Settings.hideChannelBottomButton
source: Hide Channel Bottom Panel
ar: إخفاء لوحة قاعدة القناة
ca: Amaga el panell inferior del canal
pl: Ukryj dolny panel kanału

# Settings.CallConfirmation
source: Call Confirmation
ar: تأكيد الاتصال
ca: Confirmació de trucada
pl: Potwierdzenie połączenia

# Settings.CallConfirmation.Notice
source: IntentChat will ask for your confirmation before making a call.
ar: سيطلب IntentChat تأكيدك قبل إجراء مكالمة.
ca: IntentChat et demanarà la teva confirmació abans de fer una trucada.
pl: IntentChat poprosi o Twoje potwierdzenie przed wykonaniem połączenia.

# CallConfirmation.Audio.Title
source: Make a Call?
ar: هل ترغب في إجراء مكالمة؟
ca: Vols fer una trucada?
pl: Wykonać połączenie?

# CallConfirmation.Video.Title
source: Make a Video Call?
ar: هل ترغب في إجراء مكالمة فيديو؟
ca: Vols fer una videotrucada?
pl: Wykonać połączenie wideo?

# MutualContact.Label
source: mutual contact
ar: جهة اتصال مشتركة
ca: contacte mutu
pl: wspólny kontakt

# Settings.swipeForVideoPIP
source: Video PIP with Swipe
ar: فيديو PIP مع السحب
ca: Vídeo PIP amb desplaçament
pl: Wideo PIP z przesunięciem

# Settings.swipeForVideoPIP.Notice
source: If enabled, swiping video will open it in Picture-in-Picture mode.
ar: إذا تم تمكينه، سيفتح سحب الفيديو في وضع الصورة في الصورة.
ca: Si està habilitat, desplaçar el vídeo l'obrirà en mode Imatge en Imatge.
pl: Jeśli włączone, przesunięcie wideo otworzy je w trybie obrazu w obrazie.
